test/vcrs/bridgepay-ping.yml

---
http_interactions:
- request:
    method: post
    uri: https://www.bridgepaynetsecuretest.com/PaymentService/RequestHandler.svc
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://bridgepaynetsecuretx.com/requesthandler"
        xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ins0="http://schemas.microsoft.com/2003/10/Serialization/Arrays"
        xmlns:ins1="http://schemas.datacontract.org/2004/07/Bridgepay.Core.DataContracts"><env:Body><tns:ProcessRequest><tns:requestMsg>PHJlcXVlc3RIZWFkZXI+PENsaWVudElkZW50aWZpZXI+U09BUDwvQ2xpZW50SWRlbnRpZmllcj48VHJhbnNhY3Rpb25JRD41MGE0OWU4Ny1mMjE2LTQ1MDMtOGM1Mi1iNmQ4NWFkMGY4MjA8L1RyYW5zYWN0aW9uSUQ+PFJlcXVlc3RUeXBlPjA5OTwvUmVxdWVzdFR5cGU+PFVzZXI+YmxyMDM3dGVzdDwvVXNlcj48UGFzc3dvcmQ+NTchc0VAM0ZtPC9QYXNzd29yZD48UmVxdWVzdERhdGVUaW1lPjIwMTcwMzI3MTUzOTA4PC9SZXF1ZXN0RGF0ZVRpbWU+PHJlcXVlc3RNZXNzYWdlPjwvcmVxdWVzdE1lc3NhZ2U+PC9yZXF1ZXN0SGVhZGVyPg==</tns:requestMsg></tns:ProcessRequest></env:Body></env:Envelope>
    headers:
      Soapaction:
      - '"http://bridgepaynetsecuretx.com/requesthandler/IRequestHandler/ProcessRequest"'
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '935'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Mon, 27 Mar 2017 15:39:09 GMT
      Content-Type:
      - text/xml; charset=utf-8
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Keep-Alive:
      - timeout=5
      Vary:
      - Accept-Encoding
      X-Powered-By:
      - ASP.NET
      Set-Cookie:
      - LBCS=!vHaGE7lRT6jXJUheNdJ7GmI10peQCtpwoej9HGMrQuqzH2LOSIsRjJgTRuZy7EZjaL04jNv2TN1udWM=;
        path=/; Secure; HttpOnly
      X-Frame-Options:
      - SAMEORIGIN
      Server:
      - ''
      Strict-Transport-Security:
      - max-age=31536000
    body:
      encoding: ASCII-8BIT
      string: <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body><ProcessRequestResponse
        xmlns="http://bridgepaynetsecuretx.com/requesthandler"><ProcessRequestResult>PFBpbmc+PFRyYW5zYWN0aW9uSUQ+NTBhNDllODctZjIxNi00NTAzLThjNTItYjZkODVhZDBmODIwPC9UcmFuc2FjdGlvbklEPjxSZXF1ZXN0VHlwZT4wOTk8L1JlcXVlc3RUeXBlPjxSZXNwb25zZUNvZGU+MDAwMDA8L1Jlc3BvbnNlQ29kZT48UmVzcG9uc2VEZXNjcmlwdGlvbj5TdWNjZXNzZnVsIFJlcXVlc3Q8L1Jlc3BvbnNlRGVzY3JpcHRpb24+PHJlc3BvbnNlTWVzc2FnZSAvPjwvUGluZz4=</ProcessRequestResult></ProcessRequestResponse></s:Body></s:Envelope>
    http_version: 
  recorded_at: Mon, 27 Mar 2017 15:39:08 GMT
recorded_with: VCR 3.0.3
